<template>
    <div class="py-8">
        <div class="max-w-6xl mx-auto px-5">
            <h3 class="text-center font-bold text-3xl lg:text-4xl mb-6">FAQ</h3>
            <div class="max-w-lg mx-auto flex justify-center mb-8">
                <div class="flex flex-no-wrap overflow-x-auto scrollClass">
                    <button v-for="theme in themes"
                            :key="theme.id"
                            @click.stop="activeTheme = theme.id"
                            :class="[theme.id === activeTheme ? active : '']"
                            class="w-72 px-5 py-3 mr-3 rounded bg-gray-600 hover:bg-gray-500 focus:outline-none text-sm text-white uppercase font-semibold"
                    >
                        {{ theme.title }}
                    </button>
                </div>
            </div>
            <div class="max-w-3xl mx-auto">
                <div v-for="faq in themes[activeTheme].faqs" class="pb-2 pt-2">
                    <div class="w-full flex justify-between items-center border-b pb-4">
                        <a @click="faq.isVisible = !faq.isVisible" class="font-medium text-gray-800 text-base md:text-lg hover:text-brand-green cursor-pointer leading-tight">{{ faq.question }}</a>
                        <span @click="faq.isVisible = !faq.isVisible" class="font-semibold text-gray-800 text-lg hover:text-brand-green cursor-pointer">{{ faq.isVisible ? '-' : '+' }}</span>
                    </div>
                    <div v-show="faq.isVisible" class="py-3 border-b">
                        <p class="font-light text-gray-800">{{ faq.answer }}</p>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>
<style scoped>
    .scrollClass{
        /*max-width: 480px;*/
        /*margin: 0 auto;*/
        -webkit-overflow-scrolling: touch; /* [3] */
        -ms-overflow-style: -ms-autohiding-scrollbar;
    }
    .scrollClass::-webkit-scrollbar{
        display: none;
    }
</style>
<script>
    export default {
        name: "Faq",
        data(){
            return{
                activeTheme: 0,
                active: 'bg-brand-green hover:bg-brand-green-hover shadow-lg',
                themes: [
                    {
                        id: 0,
                        title: 'Курс',
                        faqs: [
                            {
                                id: 0,
                                question: 'Какова продолжительность курса?',
                                answer: 'Сервис Eat&Fit предлагает 21-дневный план перехода к здоровому питанию. В рамках 3.5 недель (без воскресений) мы готовим Вам рацион из 7-9 блюд на 5-6 приемов пищи общей калорийностью, заданной Вашими целями, комплекцией и образом жизни',
                                isVisible: false
                            },
                            {
                                id: 1,
                                question: 'Почему именно 21 день?',
                                answer: '3-4 недели - это тот период, за который Ваш организм действительно привыкнет к небольшим порциям и частым приемам пищи. Также за этот период уже можно проследить какой-то видимый результат. Но в целом, можно заказать на любое количество дней',
                                isVisible: false
                            },
                            {
                                id: 2,
                                question: 'Что делать после 21 дня и как питаться по воскресеньям?',
                                answer: 'Мы предлагаем курс к оздоровлению Вашего рациона. Как правило, этого времени достаточно, чтобы появилось понимание того, как примерно должна выглядеть Ваша продуктовая корзина и какими порциями следует есть. В воскресенье рекомендуем постараться самостоятельно воссоздать одно из понравившихся меню за неделю',
                                isVisible: false
                            },
                            {
                                id: 3,
                                question: 'Можно ли делать воскресенье разгрузочным днем?',
                                answer: 'В принципе, у Вас вся неделя с нами не будет "тяжелой", потому вряд стоит устраивать разгрузочный день или тем более голодать в воскресенье. Если Ваша цель - снижение веса, то рацион и так будет дефицитным в течение всей недели. Постарайтесь придерживаться плана и в воскресный день тоже. Разве что один из приемов пищи вполне можно сделать из ряда вон выходящим, такая практика зовется cheatmeal',
                                isVisible: false
                            },
                            {
                                id: 4,
                                question: 'Можно ли продолжить второй курс сразу по окончанию первого?',
                                answer: 'Безусловно! Наш рацион - не ограниченная диета, это полноценное сбалансированное меню на каждый день, с расчетом объемов порций под Ваши нужды. Потому Вы определенно можете продолжить следующий курс. Более того, каждый следующий цикл подряд будет длиннее на один бонусный день',
                                isVisible: false
                            },
                            {
                                id: 5,
                                question: 'Как подобрать калорийность рациона?',
                                answer: 'Сделать это наверняка довольно сложно, даже если вы пройдете фитнес-тест на определение базового метаболизма, все равно день ото дня уровень энергозатрат будет колебаться. Мы можем предложить вам одну из наших программ, а далее будем отслеживать результаты и оценивать их. В случае чего всегда можно откорректировать рацион в плюс или минус',
                                isVisible: false
                            },
                            {
                                id: 6,
                                question: 'Каких результатов достигают ваши клиенты? И какие гарантии вы даете?',
                                answer: 'Наш сервис является планом перехода к здоровому питанию. Однако, каждый наш подопечный индивидуален, и во многом все зависит от Вашего графика дня и образа жизни, скорости обмена веществ, гормонального фона и других особенностей. Тем не менее средние результаты при снижении веса: 3-5кг. за курс. Если Вы будете следовать рекомендациям, то результаты не заставят себя ждать, и они выражаются не только в цифрах. Также можно отметить улучшение кожи, волос, ногтей и общего самочувствия',
                                isVisible: false
                            }
                        ]
                    },
                    {
                        id: 1,
                        title: 'Питание',
                        faqs: [
                            {
                                id: 0,
                                question: 'Если диетолог прописал мне определенное меню, могу ли я заказывать его у вас?',
                                answer: 'К сожалению, наш сервис не предусматривает приготовление блюд по строгой диете. Если же вас интересует гибкая система с общим изложением принципов питания и каких-то установленных ограничений, то мы готовы обсудить детали в индивидуальном порядке. Оставьте, пожалуйста, свой номер, с Вами свяжется специалист',
                                isVisible: false
                            },
                            {
                                id: 1,
                                question: 'Кому подходит ваша программа? Можно ли заказать ее при беременности/грудном вскармливании?',
                                answer: 'Зачастую, в основе снижения веса лежит дефицит калорий. В Вашем случае мы советуем подойти к выбору рациона более трепетно, предварительно проконсультировавшись с вашим врачом и с нашим менеджером. Оставьте, пожалуйста, свой номер, с Вами свяжется специалист для индивидуальной консультации',
                                isVisible: false
                            },
                            {
                                id: 2,
                                question: 'Можно ли есть помимо вашей еды что-то еще? Что пить?',
                                answer: 'Мы не в праве Вас в чем-либо ограничивать. Но вы должны отдавать себе отчет, что все съеденное дополнительно будет увеличивать общую дневную калорийность. Рекомендуется выпивать норму воды (от 1.5-2л и более), чай или кофе вы можете пить по желанию, однако без сахара, разумеется',
                                isVisible: false
                            },
                            {
                                id: 3,
                                question: 'Можно ли совмещать с приемами лекарственных препаратов, биодобавок или спортивных добавок?',
                                answer: 'Данный вопрос стоит обсудить с вашим лечащим врачом или персональным тренером',
                                isVisible: false
                            }
                        ]
                    },
                    {
                        id: 2,
                        title: 'Условия',
                        faqs: [
                            {
                                id: 0,
                                question: 'Составляете ли вы индивидуальное меню и где можно посмотреть меню на каждый день?',
                                answer: 'Меню делится на программы относительно общей калорийности и соотношения белков, жиров и углеводов. Одно из направлений нашего сервиса – создание своей линейки блюд разных стран и народов. Т.е. каждый день Вы будете получать диетический вариант меню, построенной на основе кухни определенной страны. К примеру, Италии, Франции или Паназии. Однако если у Вас имеются продукты-аллергены или какие-то другие ограничения, установленные гастроэнтерологом или эндокринологом, обязательно сообщите нам, мы исключим и заменим эти продукты на другие в рамках линейки рационов SELECT',
                                isVisible: false
                            },
                            {
                                id: 1,
                                question: 'В какое время доставляют еду?',
                                answer: 'Доставка происходит ежедневно в утреннее время с 06.45 до 10.00 в заранее обговоренный интервал времени. Курьер привозит Вам по указанному адресу пакет с рационом на весь день. Если же требуется поменять место или врем доставки, просим Вас сообщить об этом менеджеру с вечера',
                                isVisible: false
                            },
                            {
                                id: 2,
                                question: 'Что делать, если я часто уезжаю из города?',
                                answer: 'Вы всегда можете сообщить нам об отъезде за 12 часов до доставки, мы приостановим Ваш курс до возвращения. К приезду Вас будет ждать очередная порция здоровых блюд',
                                isVisible: false
                            },
                            {
                                id: 3,
                                question: 'Где вы покупаете продукты?',
                                answer: 'В случае, как и с ресторанами, у нас есть свои сертифицированные поставщики. В большинстве случаев мы работаем напрямую с фирмами-производителями',
                                isVisible: false
                            }
                        ]
                    },
                    {
                        id: 3,
                        title: 'Оплата',
                        faqs: [
                            {
                                id: 0,
                                question: 'Предусматриваются ли какие-то скидки при заказе на нескольких человек? Можно ли оплачивать частями?',
                                answer: 'Действует гибкая система скидок и премирования бонусными днями - за подробностями обращайтесь к менеджеру',
                                isVisible: false
                            },
                            {
                                id: 1,
                                question: 'Как сделать заказ? И как лучше произвести оплату?',
                                answer: 'Можно оформить заявку прямо по телефону. Оплату вы можете произвести перечислением на карту, через пос-терминал или наличными нашему менеджеру в момент получения первого пакета. Как вам удобнее',
                                isVisible: false
                            }
                        ]
                    }
                ]
            }
        }
    }
</script>
